# Titanic

Schritte:
* Erkunden
* Vorverarbeitung
* Visualisieren
* Trainieren
* Evaluierung

## 1. Datenset laden

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.svm import SVC
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from sklearn import metrics

In [29]:
titanic_data_raw = pd.read_csv('input/train.csv')

## 2. Erkunden

![We're not talking about these pandas.](input/Titanic_Explained.png)
Port of Embarkation = Abfahrtshafen

In [6]:
titanic_data_raw.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
677,678,1,3,"Turja, Miss. Anna Sofia",female,18.0,0,0,4138,9.8417,NaN,S
543,544,1,2,"Beane, Mr. Edward",male,32.0,1,0,2908,26.0000,NaN,S
167,168,0,3,"Skoog, Mrs. William (Anna Bernhardina Karlsson)",female,45.0,1,4,347088,27.9000,NaN,S
688,689,0,3,"Fischer, Mr. Eberhard Thelander",male,18.0,0,0,350036,7.7958,NaN,S
83,84,0,1,"Carrau, Mr. Francisco M",male,28.0,0,0,113059,47.1000,NaN,S
105,106,0,3,"Mionoff, Mr. Stoytcho",male,28.0,0,0,349207,7.8958,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
612,613,1,3,"Murphy, Miss. Margaret Jane",female,NaN,1,0,367230,15.5000,NaN,Q
408,409,0,3,"Birkeland, Mr. Hans Martin Monsen",male,21.0,0,0,312992,7.7750,NaN,S
187,188,1,1,"Romaine, Mr. Charles Hallace (""Mr C Rolmane"")",male,45.0,0,0,111428,26.5500,NaN,S

In [8]:
titanic_data_raw.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
titanic_data_raw['SibSp'].unique()

array([1, 0, 3, 4, 2, 5, 8])

In [10]:
titanic_data_raw['Parch'].unique()

array([0, 1, 2, 5, 3, 4, 6])

In [37]:
titanic_data_raw.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  889.000000  889.000000  712.000000  889.000000  889.000000  889.000000
mean     0.382452    2.311586   29.642093    0.524184    0.382452   32.096681
std      0.486260    0.834700   14.492933    1.103705    0.806761   49.697504
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.000000    0.000000    0.000000    7.895800
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [45]:
titanic_data_raw["Survived"].value_counts()

0    549
1    340
Name: Survived, dtype: int64

In [36]:
titanic_data_raw.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Embarked      0
dtype: int64

Idee: 

Embarked - Zeilen Drop

Cabin - Transformieren (Nein weil wenn man ansieht in der 1 Klasse hat die Person auch keine Cabine) oder spalte drop

Age - Interpalation

Passanger Id - Spalte Drop weil es nicht relevant ist

Name - Spalte Drop weil komplett unterschiedlich, nicht relevant wie viele Tims gestorben sind

Ticket - Spalte Drop

## 3. Vorvearbeitung

### 3.1 Löschen von Null Werten

In [32]:
titanic_data_raw.drop('Cabin', axis=1, inplace=True)

In [41]:
titanic_data_raw.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [33]:
titanic_data_raw.drop('PassengerId', axis=1, inplace=True)

In [34]:
titanic_data_raw.drop('Name', axis=1, inplace=True)

In [40]:
titanic_data_raw.drop('Ticket', axis=1, inplace=True)

In [30]:
titanic_data_raw.dropna(axis=0, inplace=True, subset=['Embarked'])

### 3.3 Standardtisieren

In [38]:
from sklearn.preprocessing import StandardScaler

In [39]:
scaler = StandardScaler()
X_train_scaled = pd.DataFrame(scaler.fit_transform(X_train))
X_train_scaled.index = X_train.index
X_train_scaled.columns = X_train.columns
X_test_scaled = pd.DataFrame(scaler.transform(X_test))
X_test_scaled.index = X_test.index
X_test_scaled.columns = X_test.columns

NameError: name 'X_train' is not defined

### 3.2 Interpolation von Alter